## Plan Result (test_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
        name                              = "cft-apim00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (7 unchanged attributes hidden)

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-api-mgmt-appgw" -> null
          - http_listener_name         = "cft-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-api-mgmt-appgw" -> null
          - name                       = "cft-api-mgmt-appgw" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-mtls-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-mtls-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - http_listener_name         = "cft-mtls-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw" -> null
          - name                       = "cft-mtls-api-mgmt-appgw" -> null
          - priority                   = 20 -> null
          - rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rewrite_rule_set_name      = "cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-mtls-api-mgmt-appgw"
          + backend_address_pool_name  = "cft-mtls-api-mgmt-appgw"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw"
          + backend_http_settings_name = "cft-mtls-api-mgmt-appgw"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-mtls-api-mgmt-appgw"
          + http_listener_name         = "cft-mtls-api-mgmt-appgw"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw"
          + name                       = "cft-mtls-api-mgmt-appgw"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule"
          + rewrite_rule_set_name      = "cft-mtls-api-mgmt-appgw-rewriterule"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "cft-api-mgmt-appgw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "cft-api-mgmt-appgw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "cft-api-mgmt-appgw"
          + id                         = (known after apply)
          + name                       = "cft-api-mgmt-appgw"
          + priority                   = 10
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "cft-api-mgmt-appgw-rewriterule"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule"
          ~ name = "cft-mtls-api-mgmt-appgw-rewriterule" -> "cft-api-mgmt-appgw-rewriterule"

          ~ rewrite_rule {
              ~ name          = "ClientCertAddCustomHeaderRule" -> "SdtAddCustomHeadersRule"
                # (1 unchanged attribute hidden)

                # (3 unchanged blocks hidden)
            }
          + rewrite_rule {
              + name          = "SdtUrlRewriteRule"
              + rule_sequence = 200

              + condition {
                  + ignore_case = false
                  + negate      = false
                  + pattern     = ".*/producers(?>-comx)?/service/sdtapi"
                  + variable    = "uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/sdt-gateway"
                  + reroute    = false
                }
            }
        }
      + rewrite_rule_set {
          + name = "cft-mtls-api-mgmt-appgw-rewriterule"

          + rewrite_rule {
              + name          = "SdtAddCustomHeadersRule"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "CLIENT-IP-AGW"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-ARR-ClientCertSub-AGW"
                  + header_value = "{var_client_certificate_subject}"
                }
              + request_header_configuration {
                  + header_name  = "URI-PATH-AGW"
                  + header_value = "{var_uri_path}"
                }
            }
          + rewrite_rule {
              + name          = "SdtUrlRewriteRule"
              + rule_sequence = 200

              + condition {
                  + ignore_case = false
                  + negate      = false
                  + pattern     = ".*/producers(?>-comx)?/service/sdtapi"
                  + variable    = "uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/sdt-gateway"
                  + reroute    = false
                }
            }
        }

        # (23 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1778,"Program":"tfcmt","SHA1":"","Target":"test_apim_appgw","Vars":{}} -->